; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v13 ?v1)
             (pred_1 ?v2 ?v7)
             (pred_6 ?v13 ?v7)
             (pred_7 ?v9 ?v13 )
	     (pred_2 ?v13)
             (pred_10 ?v11)
             (pred_4 ?v2)
             (pred_9 ?v7)
             (pred_8 ?v13)
             (pred_3 ?v2)
             (pred_12 ?v13)
             (pred_11 ))



(:action op_5
:parameters (?v10 ?v3 ?v6 ?v12)
:precondition (and (pred_10 ?v10) (pred_10 ?v3) (pred_4 ?v6) (pred_9 ?v12)
          (pred_5 ?v10 ?v3) (pred_1 ?v6 ?v12)
                   (pred_6 ?v3 ?v12) (pred_2 ?v10) 
                   (pred_8 ?v3) (pred_3 ?v6))
:effect (and  (pred_12 ?v3) (not (pred_8 ?v3))))


(:action op_3
:parameters (?v10 ?v8)
:precondition (and (pred_10 ?v10) (pred_10 ?v8)
               (pred_2 ?v10) (pred_5 ?v10 ?v8) (pred_12 ?v8))
:effect (and (pred_2 ?v8) (not (pred_2 ?v10))))

(:action op_1
:parameters (?v10 ?v6)
:precondition (and (pred_10 ?v10) (pred_4 ?v6) 
                  (pred_2 ?v10) (pred_7 ?v6 ?v10) (pred_11 ))
:effect (and (pred_3 ?v6)
   (not (pred_7 ?v6 ?v10)) (not (pred_11 ))))


(:action op_2
:parameters (?v10 ?v4 ?v5)
:precondition (and (pred_10 ?v10) (pred_4 ?v4) (pred_4 ?v5)
                  (pred_2 ?v10) (pred_3 ?v5) (pred_7 ?v4 ?v10))
:effect (and (pred_3 ?v4) (pred_7 ?v5 ?v10)
        (not (pred_3 ?v5)) (not (pred_7 ?v4 ?v10))))

(:action op_4
:parameters (?v10 ?v6)
:precondition (and (pred_10 ?v10) (pred_4 ?v6) 
                  (pred_2 ?v10) (pred_3 ?v6))
:effect (and (pred_11 ) (pred_7 ?v6 ?v10) (not (pred_3 ?v6)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_04 obj_08 obj_15 obj_05 obj_12 obj_10 obj_18 obj_11 obj_17 obj_06 obj_19 obj_20 obj_09 obj_07 obj_02 obj_13
    obj_16 obj_03
    obj_01 obj_14
    )

    (:init
       (pred_11)

       (pred_10 obj_04)
       (pred_10 obj_08)
       (pred_10 obj_15)
       (pred_10 obj_05)
       (pred_10 obj_12)
       (pred_10 obj_10)
       (pred_10 obj_18)
       (pred_10 obj_11)
       (pred_10 obj_17)
       (pred_10 obj_06)
       (pred_10 obj_19)
       (pred_10 obj_20)
       (pred_10 obj_09)
       (pred_10 obj_07)
       (pred_10 obj_02)
       (pred_10 obj_13)
       (pred_9 obj_16)
       (pred_9 obj_03)
       (pred_4 obj_01)
       (pred_4 obj_14)

       (pred_5 obj_04 obj_12)
       (pred_5 obj_04 obj_08)
       (pred_5 obj_08 obj_10)
       (pred_5 obj_08 obj_15)
       (pred_5 obj_08 obj_04)
       (pred_5 obj_15 obj_18)
       (pred_5 obj_15 obj_05)
       (pred_5 obj_15 obj_08)
       (pred_5 obj_05 obj_11)
       (pred_5 obj_05 obj_15)
       (pred_5 obj_12 obj_17)
       (pred_5 obj_12 obj_10)
       (pred_5 obj_12 obj_04)
       (pred_5 obj_10 obj_06)
       (pred_5 obj_10 obj_18)
       (pred_5 obj_10 obj_08)
       (pred_5 obj_10 obj_12)
       (pred_5 obj_18 obj_19)
       (pred_5 obj_18 obj_11)
       (pred_5 obj_18 obj_15)
       (pred_5 obj_18 obj_10)
       (pred_5 obj_11 obj_20)
       (pred_5 obj_11 obj_05)
       (pred_5 obj_11 obj_18)
       (pred_5 obj_17 obj_09)
       (pred_5 obj_17 obj_06)
       (pred_5 obj_17 obj_12)
       (pred_5 obj_06 obj_07)
       (pred_5 obj_06 obj_19)
       (pred_5 obj_06 obj_10)
       (pred_5 obj_06 obj_17)
       (pred_5 obj_19 obj_02)
       (pred_5 obj_19 obj_20)
       (pred_5 obj_19 obj_18)
       (pred_5 obj_19 obj_06)
       (pred_5 obj_20 obj_13)
       (pred_5 obj_20 obj_11)
       (pred_5 obj_20 obj_19)
       (pred_5 obj_09 obj_07)
       (pred_5 obj_09 obj_17)
       (pred_5 obj_07 obj_02)
       (pred_5 obj_07 obj_06)
       (pred_5 obj_07 obj_09)
       (pred_5 obj_02 obj_13)
       (pred_5 obj_02 obj_19)
       (pred_5 obj_02 obj_07)
       (pred_5 obj_13 obj_20)
       (pred_5 obj_13 obj_02)
       (pred_8 obj_19)
       (pred_8 obj_04)
       (pred_6  obj_19 obj_16)
       (pred_6  obj_04 obj_03)
       (pred_12 obj_08)
       (pred_12 obj_15)
       (pred_12 obj_05)
       (pred_12 obj_12)
       (pred_12 obj_10)
       (pred_12 obj_18)
       (pred_12 obj_11)
       (pred_12 obj_17)
       (pred_12 obj_06)
       (pred_12 obj_20)
       (pred_12 obj_09)
       (pred_12 obj_07)
       (pred_12 obj_02)
       (pred_12 obj_13)

       (pred_1  obj_01 obj_16)
       (pred_1  obj_14 obj_03)
       (pred_7 obj_01 obj_02)
       (pred_7 obj_14 obj_18)
       (pred_2 obj_13)
    )

    (:goal (and
       (pred_7 obj_14 obj_12)
    ))
(:constraints
  (always (not (pred_2 obj_10)))
)
)

; plan
1. (op_3 obj_13 obj_20)
   deleted: (pred_2 obj_13)
   added: (pred_2 obj_20)
   goals met: 0 of 1
2. (op_3 obj_20 obj_11)
   deleted: (pred_2 obj_20)
   added: (pred_2 obj_11)
   goals met: 0 of 1
3. (op_3 obj_11 obj_18)
   deleted: (pred_2 obj_11)
   added: (pred_2 obj_18)
   goals met: 0 of 1
4. (op_1 obj_18 obj_14)
   deleted: (pred_7 obj_14 obj_18) (pred_11)
   added: (pred_3 obj_14)
   goals met: 0 of 1
5. (op_3 obj_18 obj_15)
   deleted: (pred_2 obj_18)
   added: (pred_2 obj_15)
   goals met: 0 of 1
6. (op_3 obj_15 obj_08)
   deleted: (pred_2 obj_15)
   added: (pred_2 obj_08)
   goals met: 0 of 1
7. (op_5 obj_08 obj_04 obj_14 obj_03)
   deleted: (pred_8 obj_04)
   added: (pred_12 obj_04)
   goals met: 0 of 1
8. (op_3 obj_08 obj_04)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_04)
   goals met: 0 of 1
9. (op_3 obj_04 obj_12)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_12)
   goals met: 0 of 1
10. (op_4 obj_12 obj_14)
   deleted: (pred_3 obj_14)
   added: (pred_11) (pred_7 obj_14 obj_12)
   goals met: 1 of 1
